<details ><summary>apply for core 2025-02-28 18:21:24 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project LumeWeb/pinner.xyz-devops#core has been locked by PR #16
</details>

<details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.renterd will be updated in-place
  ~ resource "cloudns_dns_record" "renterd" {
        id    = "564774697"
        name  = "pinner-core-renterd-solo.node"
      ~ value = "qksu3gfst1errcv4hfbilnvi6k.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.renterd_s3 will be updated in-place
  ~ resource "cloudns_dns_record" "renterd_s3" {
        id    = "564774698"
      ~ name  = "qksu3gfst1errcv4hfbilnvi6k.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
      ~ value = "qksu3gfst1errcv4hfbilnvi6k.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.renterd.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ renterd_s3_endpoint = "pinner-core-renterd-solo.node.pinner.xyz:32410" -> (known after apply)
module.renterd.module.renterd_deployment.akash_deployment.service: Creating...
module.renterd.module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd.module.renterd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.renterd.module.renterd_deployment.akash_deployment.service: Creation complete after 24s [id=20437727:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.renterd_s3: Modifying... [id=564774698]
cloudns_dns_record.renterd: Modifying... [id=564774697]
cloudns_dns_record.renterd: Modifications complete after 1s [id=564774697]
cloudns_dns_record.renterd_s3: Modifications complete after 1s [id=564774698]

Apply complete! Resources: 1 added, 2 changed, 0 destroyed.

Outputs:

base_domain = "pinner.xyz"
environment = "prod"
etcd_endpoint = "http://provider.ny-01.node.infra.lumeweb.com:31124"
etcd_password = <sensitive>
etcd_username = <sensitive>
mysql_endpoint = "provider.ny-01.node.infra.lumeweb.com:30935"
renterd_endpoint = "pinner-core-renterd-solo.node.pinner.xyz"
renterd_s3_endpoint = "pinner-core-renterd-solo.node.pinner.xyz:30774"

```
</details>

</details>